myCase2-2-1_apply/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    defaultFaces
    {
        type            wall;
        nFaces          288;
        startFace       8087;
    }
    air_to_soc
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          108;
        startFace       8375;
        sampleMode      nearestPatchFace;
        sampleRegion    soc;
        samplePatch     soc_to_air;
    }
    air_to_board
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          2598;
        startFace       8483;
        sampleMode      nearestPatchFace;
        sampleRegion    board;
        samplePatch     board_to_air;
    }
)

// ************************************************************************* //
